KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Spi/Inc/Reg_eSys_DSPI.h
/**
*   @file    Reg_eSys_DSPI.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Spi - Reg eSys header file.
*   @details Reg eSys header file.

*   @addtogroup [SPI_MODULE]
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : DSPI
*   Dependencies         : 
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC5777C_MCAL_1_0_1_RTM_ASR_REL_4_0_REV_0003_20170519
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_DSPI_H
#define REG_ESYS_DSPI_H

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section [global]
* Violates MISRA 2004 Required Rule 5.1, Identifiers (internal and external) shall not rely 
* on the significance of more than 31 characters.
*
* @section Reg_eSys_DSPI_h_REF_1
* Violates MISRA 2004 Advisory Rule 19.7,
* A function should be used in preference to a function-like macro.
* Compiler abstraction need to implement function-like macros to hide
* compiler specifics from the implementation.
*
* @section Reg_eSys_DSPI_h_REF_2
* Violates MISRA 2004 Required Rule 19.15,
* Precautions shall be taken in order to prevent the contents of a header file being included twice.
* This comes from the order of includes in the .c file and from include dependencies. As a safe
* approach, any file must include all its dependencies. Header files are already protected against
* double inclusions. The inclusion of MemMap.h is as per Autosar requirement MEMMAP003.
*
* @section Reg_eSys_DSPI_h_REF_4
* Violates MISRA 2004 Required Rule 1.4,
* The compiler/linker shall be checked to ensure that 31 character significance and case sensitivity
* are supported for external identifiers.
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/
/**
* @file           Reg_eSys_DSPI.c
* @requirements   BSW00374, BSW00318, SPI276.
*/
/*
* @violates @ref Reg_eSys_DSPI_h_REF_2 Precautions shall be taken in order to prevent the contents of a header 
* file being included twice.
*/
#include "Reg_eSys.h"
#include "StdRegMacros.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/
/**
* @file           Reg_eSys_DSPI.h
*/
#define SPI_VENDOR_ID_REGFLEX                    43
#define SPI_AR_RELEASE_MAJOR_VERSION_REGFLEX     4
#define SPI_AR_RELEASE_MINOR_VERSION_REGFLEX     0
/*
* @violates @ref Reg_eSys_DSPI_h_REF_4 The compiler/linker shall be checked to
* ensure that 31 character significance and case sensitivity are supported for
* external identifiers.
*/
#define SPI_AR_RELEASE_REVISION_VERSION_REGFLEX  3
#define SPI_SW_MAJOR_VERSION_REGFLEX             1
#define SPI_SW_MINOR_VERSION_REGFLEX             0
#define SPI_SW_PATCH_VERSION_REGFLEX             1

/*==================================================================================================
*                                     FILE VERSION CHECKS
==================================================================================================*/
#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
  /* Check if the source file and Reg_eSys header file are of the same version */
  #if ((SPI_AR_RELEASE_MAJOR_VERSION_REGFLEX != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
       (SPI_AR_RELEASE_MINOR_VERSION_REGFLEX != REG_ESYS_AR_RELEASE_MINOR_VERSION))
      #error "AutoSar Version Numbers of Reg_eSys_DSPI.c and Reg_eSys.h are different"
  #endif

  /* Check if the source file and StdRegMacros header file are of the same version */
  #if ((SPI_AR_RELEASE_MAJOR_VERSION_REGFLEX != STDREGMACROS_AR_RELEASE_MAJOR_VERSION) || \
       (SPI_AR_RELEASE_MINOR_VERSION_REGFLEX != STDREGMACROS_AR_RELEASE_MINOR_VERSION))
      #error "AutoSar Version Numbers of Reg_eSys_DSPI.c and StdRegMacros.h are different"
  #endif
#endif

/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/
#define SPI_START_SEC_CONST_32
/*
* @violates @ref Reg_eSys_DSPI_h_REF_2 Precautions shall be taken in order to prevent the contents of a header 
* file being included twice.
*/
 #include "MemMap.h"
 

/* HWUnit base address mapping array */
extern CONST(uint32, SPI_CONST) Spi_Dspi_au32BaseAddrs[13];

#define SPI_STOP_SEC_CONST_32
/*
* @violates @ref Reg_eSys_DSPI_h_REF_2 Precautions shall be taken in order to prevent the contents of a header 
* file being included twice.
*/
 #include "MemMap.h"
 /*==================================================================================================
*                                      DEFINES AND MACROS
==================================================================================================*/

/**
* @brief Macros used for low-level DSPI register manipulation (begin section).
*/
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*to a function-like macro.
*/

#define DSPI_GET_BASE_ADDRESS_U32(offset) \
    ((uint32)Spi_Dspi_au32BaseAddrs[(offset)])

/* Mode control Register */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_MCR_ADDR32(offset) \
    ((uint32) ((uint32)Spi_Dspi_au32BaseAddrs[(offset)]))

/* Transfer count */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_TCR_ADDR32(offset) \
    ((uint32) ((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x08u))

