KevinWangJian/SPC5775B_MCAL_Demo/src/MCAL/Module/Spi/Inc/Reg_eSys_DSPI.h
/* DSPI Clock and transfer attributes */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_GENERATE_CTAR_U32(nrofctar) \
    (((nrofctar) - 1u) << 28u)
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_CTAR0_ADDR32(offset) \
    ((uint32) ((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x0Cu))

/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_CTAR3_ADDR32(offset) \
    ((uint32) ((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x18u))

/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_CTAR_ADDR32(offset, selected_ctar) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + ((((selected_ctar) - 1u) << 2u) + 0x0Cu)))

/* DSPI Status register */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_BASEADDR2SR_ADDR32(base_addr) \
    ((uint32)((base_addr) + 0x2Cu))
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_SR_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x2Cu))

/* DSPI DMA/Interrupt request select and enable register */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_RSER_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x30u))

/* DSPI Push TX FIFO Register */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_BASEADDR2PUSHR_ADDR32(base_addr) \
    ((uint32)((base_addr) + 0x34u))
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_PUSHR_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x34u))

/* DSPI Pop RX register */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_BASEADDR2POPR_ADDR32(base_addr) \
    ((uint32)((base_addr) + 0x38u))
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_POPR_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x38u))

/* Not used for SPI module - driver/handler */

/* DSPI DSI Config register 0 */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0xBCu))

/* DSPI DSI alternate serialization data register 0 */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_ASDR_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0xC4u))

/* DSPI DSI Config register 1 */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_DSICR1_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0xD0u))

/* DSPI DSI alternate serialization data register 1 */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_ASDR1_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0xF4u))
    
#ifdef ITSB_MODE_SUPPORTED    
/* DSPI Time slot length register */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_TSL_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x150u))
/* DSPI Time slot configuration register */
/*
* @violates @ref Reg_eSys_DSPI_h_REF_1 A function should be used in preference
*   to a function-like macro.
*/
#define DSPI_TS_CONF_ADDR32(offset) \
    ((uint32)((uint32)Spi_Dspi_au32BaseAddrs[(offset)] + 0x154u))    
#endif /*ITSB_MODE_SUPPORTED*/    
/*-----------------------------------------------------------------------*/

/* DSPI reserved bit masks */
#define DSPI_MCR_RESERVED_MASK_U32         ((uint32)0xFFFF7F0Fu)
#define DSPI_TCR_RESERVED_MASK_U32         ((uint32)0xFFFF0000u)
#define DSPI_CTAR_SLAVE_RESERVED_MASK_U32  ((uint32)0x7F800000u)
#define DSPI_SR_RESERVED_MASK_U32          ((uint32)0xFEFF0000u)
#define DSPI_RSER_RESERVED_MASK_U32        ((uint32)0xFFFFC000u)
#define DSPI_PUSHR_RESERVED_MASK_U32       ((uint32)0xFFFFFFFFu)
#define DSPI_DSICR_RESERVED_MASK_U32       ((uint32)0x403DFFFFu)
#define DSPI_DSICR1_RESERVED_MASK_U32      ((uint32)0x1F03FFFFu)

/* DSPI MCR attributes */
#define DSPI_MCR_MSTR_U32            ((uint32)0x80000000u)
#define DSPI_MCR_DCONF_U32           ((uint32)0x30000000u)
#define DSPI_MCR_CONT_SCKE_U32       ((uint32)0x40000000u)
#define DSPI_MCR_PCSIS_ALL_U32       ((uint32)0x00FF0000u)
#define DSPI_MCR_MDIS_U32            ((uint32)0x00004000u)  /*Module Disable*/
#define DSPI_MCR_CLR_TXF_U32         ((uint32)0x00000800u)  /*Clear TX FIFO*/
#define DSPI_MCR_CLR_RXF_U32         ((uint32)0x00000400u)  /*Clear RX FIFO*/
#define DSPI_MCR_HALT_U32            ((uint32)0x00000001u)  /*Halt 0 : starts tranfer, 1: stops transfer*/
#define DSPI_MCR_RESET_U32           (DSPI_MCR_MDIS_U32 | DSPI_MCR_HALT_U32) /* Reset value */

/* DSPI TCR attributes */
#define DSPI_TCR_RESET_U32           ((uint32)0x00000000u)

#ifdef TSB_MODE_SUPPORTED
/*Added for initialisation in TSB mode*/
#define DSPI_MCR_DCONF_DSI_U32       ((uint32)0x10000000u)  /*DSI configuration of DSPI*/
#define DSPI_MCR_DCONF_CSI_U32       ((uint32)0x20000000u)  /*CSI configuration of DSPI*/
#define DSPI_MCR_RX_FIFO_U32         ((uint32)0x00001000u)  /*Receive FIFO*/
#define DSPI_MCR_TX_FIFO_U32         ((uint32)0x00002000u)  /*Transmit FIFO*/
#endif /*TSB_MODE_SUPPORTED*/

#define DSPI_PCS0_IDLEHIGH_U32       ((uint32)0x00010000u)
#define DSPI_PCS1_IDLEHIGH_U32       ((uint32)0x00020000u)
#define DSPI_PCS2_IDLEHIGH_U32       ((uint32)0x00040000u)
#define DSPI_PCS3_IDLEHIGH_U32       ((uint32)0x00080000u)
#define DSPI_PCS4_IDLEHIGH_U32       ((uint32)0x00100000u)
#define DSPI_PCS5_IDLEHIGH_U32       ((uint32)0x00200000u)
#define DSPI_PCS6_IDLEHIGH_U32       ((uint32)0x00400000u)
#define DSPI_PCS7_IDLEHIGH_U32       ((uint32)0x00800000u)

/* Write to CTARx Register - Word access */
/* Individual flag write access shall be provided based LLD requirement */
/* Practically this file should provide write access to bits / nibble / bytes */
#define DSPI_CTAR_LSBFE_MASK_U32         ((uint32) 0x01000000u)
#define DSPI_CPHA_MASK_U32               ((uint32) 0x02000000u)
#define DSPI_LSBFE_MASK_U32              ((uint32) 0x01000000u)
#define DSPI_PCSSCK_MASK_U32             ((uint32) 0x00C00000u) /* 1, 3, 5 , 7 */
#define DSPI_PASC_MASK_U32               ((uint32) 0x00300000u)
#define DSPI_PDT_MASK_U32                ((uint32) 0x000C0000u)
#define DSPI_PBR_MASK_U32                ((uint32) 0x00030000u)
#define DSPI_CSSCK_MASK_U32              ((uint32) 0x0000F000u)
#define DSPI_ASC_MASK_U32                ((uint32) 0x00000F00u)
#define DSPI_DT_MASK_U32                 ((uint32) 0x000000F0u)
#define DSPI_BR_MASK_U32                 ((uint32) 0x0000000Fu)

/*-----------Read DSPI Status Register-Start---------------------------------*/
#define DSPI_SR_TCF_W1C                 ((uint32) 0x80000000u)
#define DSPI_SR_TXRXS_W1C               ((uint32) 0x40000000u)
#define DSPI_SR_EOQF_W1C                ((uint32) 0x10000000u)
#define DSPI_SR_TFUF_W1C                ((uint32) 0x08000000u)
#define DSPI_SR_TFFF_W1C                ((uint32) 0x02000000u)
#define DSPI_SR_DPEF_W1C                ((uint32) 0x00400000u)
#define DSPI_SR_SPEF_W1C                ((uint32) 0x00200000u)
#define DSPI_SR_DDIF_W1C                ((uint32) 0x00100000u)
#define DSPI_SR_RFOF_W1C                ((uint32) 0x00080000u)
#define DSPI_SR_RFDF_W1C                ((uint32) 0x00020000u)
#define DSPI_SR_TXCTR_MASK_U32          ((uint32) 0x0000F000u)
#define DSPI_SR_TXNXT_MASK_U32          ((uint32) 0x00000F00u)
#define DSPI_SR_RXCTR_MASK_U32          ((uint32) 0x000000F0u)
#define DSPI_SR_RXNXT_MASK_U32          ((uint32) 0x0000000Fu)
#define DSPI_SR_INT_MASK_U32 \
    ((uint32)( DSPI_SR_TCF_W1C | DSPI_SR_TXRXS_W1C | DSPI_SR_EOQF_W1C | \
    DSPI_SR_TFUF_W1C | DSPI_SR_TFFF_W1C | DSPI_SR_DPEF_W1C | \
    DSPI_SR_SPEF_W1C | DSPI_SR_DDIF_W1C | DSPI_SR_RFOF_W1C | DSPI_SR_RFDF_W1C ))

/*----Write to DSPI DMA/Interrupt Request Select and Enable - Start ----------*/
#define DSPI_RSER_TCF_RE_MASK_U32     ((uint32) 0x80000000u)
#define DSPI_RSER_EOQF_RE_MASK_U32    ((uint32) 0x10000000u)
#define DSPI_RSER_TFUF_RE_MASK_U32    ((uint32) 0x08000000u)
#define DSPI_RSER_TFFF_RE_MASK_U32    ((uint32) 0x02000000u)
#define DSPI_RSER_TFFF_DIRS_MASK_U32  ((uint32) 0x01000000u)
#define DSPI_RSER_DPEF_RE_MASK_U32    ((uint32) 0x00400000u)
#define DSPI_RSER_SPEF_RE_MASK_U32    ((uint32) 0x00200000u)
#define DSPI_RSER_DDIF_RE_MASK_U32    ((uint32) 0x00100000u)
#define DSPI_RSER_RFOF_RE_MASK_U32    ((uint32) 0x00080000u)
#define DSPI_RSER_RFDF_RE_MASK_U32    ((uint32) 0x00020000u)
#define DSPI_RSER_RFDF_DIRS_MASK_U32  ((uint32) 0x00010000u)
#define DSPI_RSER_RESET_MASK_U32      ((uint32) 0x00000000u)

/* ---------------DSPI FIFO Transmit Register - Start ----------------------- */
#define DSPI_CONT_MASK_U32           ((uint32) 0x80000000u)
#define DSPI_CTAS_MASK_U32           ((uint32) 0x70000000u)
#define DSPI_EOQ_MASK_U32            ((uint32) 0x08000000u)
#define DSPI_CTCNT_MASK_U32          ((uint32) 0x04000000u)
#define DSPI_PE_MASK_U32             ((uint32) 0x02000000u)
#define DSPI_PP_MASK_U32             ((uint32) 0x01000000u)
#define DSPI_PCS7_MASK_U32           ((uint32) 0x00800000u)
#define DSPI_PCS6_MASK_U32           ((uint32) 0x00400000u)
#define DSPI_PCS5_MASK_U32           ((uint32) 0x00200000u)
#define DSPI_PCS4_MASK_U32           ((uint32) 0x00100000u)
#define DSPI_PCS3_MASK_U32           ((uint32) 0x00080000u)
#define DSPI_PCS2_MASK_U32           ((uint32) 0x00040000u)
#define DSPI_PCS1_MASK_U32           ((uint32) 0x00020000u)
#define DSPI_PCS0_MASK_U32           ((uint32) 0x00010000u)
#define DSPI_TXDATA_MASK_U32         ((uint32) 0x0000FFFFu)

/* ---------------DSPI FIFO Receive Register - Start------------------------- */
#define DSPI_RXDATA_MASK_U32             ((uint32) 0x0000FFFFu)

/* ---------------DSPI Transmit FIFO Register0-4 - Start---------------------- */
#define DSPI_TX_CMD_MASK_U32             ((uint32) 0xFFFF0000u)

/* DSPI CTAR attributes */
#define DSPI_CTAR_RESET_U32          ((uint32)0x78000000u)
#define DSPI_CTAR_DBR_0_U32          ((uint32)0x00000000u)
#define DSPI_CTAR_DBR_1_U32          ((uint32)0x80000000u)

